mm32/mm32_classb_cm0/iec60730b_f0020/Device/MM32F0020/Include/reg_adc.h
#define ADC_JSQR_JL_Pos                 (20)                                    ///< Injected Sequence length
#define ADC_JSQR_JL_0                   (0x01U << ADC_JSQR_JL_Pos)              ///< Bit 0
#define ADC_JSQR_JL_1                   (0x02U << ADC_JSQR_JL_Pos)              ///< Bit 1
////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_JDATA mode enable Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_JDATA_JVALID_Pos            (22)
#define ADC_JDATA_JVALID                (0x01U << ADC_JDATA_JVALID_Pos)         ///< Valid flag
#define ADC_JDATA_JOVERRUN_Pos          (21)
#define ADC_JDATA_JOVERRUN              (0x01U << ADC_JDATA_JOVERRUN_Pos)       ///< Overrun flag
#define ADC_JDATA_JCHANNELSEL_Pos       (16)
#define ADC_JDATA_JCHANNELSEL           (0xFFU << ADC_JDATA_JCHANNELSEL_Pos)    ///< Channel selection
#define ADC_JDATA_JDATA_Pos             (0)
#define ADC_JDATA_JDATA                 (0xFFFFU << ADC_JSQR_JSQ0_Pos)          ///< Transfer data
////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_JDR0 mode enable Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_JDR0_JVALID_Pos             (22)
#define ADC_JDR0_JVALID                 (0x01U << ADC_JDATA_JVALID_Pos)         ///< Valid flag
#define ADC_JDR0_JOVERRUN_Pos           (21)
#define ADC_JDR0_JOVERRUN               (0x01U << ADC_JDATA_JOVERRUN_Pos)       ///< Overrun flag
#define ADC_JDR0_JDATA_Pos              (0)
#define ADC_JDR0_JDATA                  (0xFFFFU << ADC_JSQR_JSQ0_Pos)          ///< Transfer data
////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_JDR1 mode enable Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_JDR1_JVALID_Pos             (22)
#define ADC_JDR1_JVALID                 (0x01U << ADC_JDATA_JVALID_Pos)         ///< Valid flag
#define ADC_JDR1_JOVERRUN_Pos           (21)
#define ADC_JDR1_JOVERRUN               (0x01U << ADC_JDATA_JOVERRUN_Pos)       ///< Overrun flag
#define ADC_JDR1_JDATA_Pos              (0)
#define ADC_JDR1_JDATA                  (0xFFFFU << ADC_JSQR_JSQ0_Pos)          ///< Transfer data
////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_JDR2 mode enable Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_JDR2_JVALID_Pos             (22)
#define ADC_JDR2_JVALID                 (0x01U << ADC_JDATA_JVALID_Pos)         ///< Valid flag
#define ADC_JDR2_JOVERRUN_Pos           (21)
#define ADC_JDR2_JOVERRUN               (0x01U << ADC_JDATA_JOVERRUN_Pos)       ///< Overrun flag
#define ADC_JDR2_JDATA_Pos              (0)
#define ADC_JDR2_JDATA                  (0xFFFFU << ADC_JSQR_JSQ0_Pos)          ///< Transfer data
////////////////////////////////////////////////////////////////////////////////
/// @brief ADC_JDR3 mode enable Register Bit Definition
////////////////////////////////////////////////////////////////////////////////
#define ADC_JDR3_JVALID_Pos             (22)
#define ADC_JDR3_JVALID                 (0x01U << ADC_JDATA_JVALID_Pos)         ///< Valid flag
#define ADC_JDR3_JOVERRUN_Pos           (21)
#define ADC_JDR3_JOVERRUN               (0x01U << ADC_JDATA_JOVERRUN_Pos)       ///< Overrun flag
#define ADC_JDR3_JDATA_Pos              (0)
#define ADC_JDR3_JDATA                  (0xFFFFU << ADC_JSQR_JSQ0_Pos)          ///< Transfer data
/// @}

/// @}

/// @}

////////////////////////////////////////////////////////////////////////////////
#endif
////////////////////////////////////////////////////////////////////////////////
